{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      " ": 4,
      "1": 5,
      "2": 6,
      "e": 7,
      "a": 8,
      "r": 9,
      "u": 10,
      "0": 11,
      "6": 12,
      "8": 13,
      "7": 14,
      "9": 15,
      "5": 16,
      "y": 17,
      "3": 18,
      "m": 19,
      "n": 20,
      "4": 21,
      "d": 22,
      "t": 23,
      "s": 24,
      "b": 25,
      "o": 26,
      "j": 27,
      "c": 28,
      "/": 29,
      "p": 30,
      "l": 31,
      "f": 32,
      "h": 33,
      "i": 34,
      "g": 35,
      "v": 36,
      "w": 37
    },
    "unk_token": "[UNK]"
  }
}